Tekla.Structures.Dialog.StructuresExtender
The StructuresExtender class is for binding controls to datatypes. The bindings are
needed to transfer the dialog values to Tekla Structures and onwards to plug-ins.

Tekla.Structures.Dialog.StructuresExtender.CanExtend(System.Object)
Specifies whether the current object can provide its extender properties to the specified object.
extendee: The object to receive the extender properties.
Returns: True if the current object can provide its extender properties to the specified object;
otherwise, false.

Tekla.Structures.Dialog.StructuresExtender.GetAttributeName(System.Windows.Forms.Control)
Retrieves the AttributeName text associated with the specified control.
control: The control for which to retrieve the AttributeName text.
Returns:
A string containing the AttributeName text for the specified control,
or null if no text is associated with the specified control.

Tekla.Structures.Dialog.StructuresExtender.SetAttributeName(System.Windows.Forms.Control,System.String)
Associates AttributeName text with the specified control.
control: The control to associate the AttributeName text with.
value: The AttributeName text to associate with the control.

Tekla.Structures.Dialog.StructuresExtender.GetAttributeTypeName(System.Windows.Forms.Control)
Retrieves the AttributeTypeName text associated with the specified control.
control: The control for which to retrieve the AttributeTypeName text.
Returns:
A string containing the AttributeTypeName text for the specified control,
or null if no text is associated with the specified control.

Tekla.Structures.Dialog.StructuresExtender.SetAttributeTypeName(System.Windows.Forms.Control,System.String)
Associates the AttributeTypeName text with the specified control.
control: The control to associate the AttributeTypeName text with.
value: The AttributeTypeName text to associate with the control.

Tekla.Structures.Dialog.StructuresExtender.GetBindPropertyName(System.Windows.Forms.Control)
Retrieves the BindPropertyName text associated with the specified control.
control: The control for which to retrieve the BindPropertyName text.
Returns:
A string containing the BindPropertyName text for the specified control,
or null if no text is associated with the specified control.

Tekla.Structures.Dialog.StructuresExtender.SetBindPropertyName(System.Windows.Forms.Control,System.String)
Associates the BindPropertyName text with the specified control.
control: The control to associate the BindPropertyName text with.
value: The BindPropertyName text to associate with the control.

Tekla.Structures.Dialog.StructuresExtender.GetIsFilter(System.Windows.Forms.Control)
Retrieves the IsFilter boolean value associated with the specified control.
control: The control for which to retrieve the IsFilter value.
Returns:
A boolean containing the IsFilter value for the specified control.

Tekla.Structures.Dialog.StructuresExtender.SetIsFilter(System.Windows.Forms.Control,System.Boolean)
Associates the IsFilter boolean value with the specified control.
control: The control to associate the IsFilter value with.
value: The IsFilter value to associate with the control.